### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=5644798168022997553]
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=5204225899843989258]
null_resource.control_plane_build: Refreshing state... [id=3175466959401002852]
null_resource.github_bot_build[0]: Refreshing state... [id=2891797195268965891]
null_resource.web_app_cloudflare_build[0]: Refreshing state... [id=8053711833804605722]
local_file.web_app_wrangler_production[0]: Refreshing state... [id=385ba23f828f0652d32cb2612b6fec0c46009699]
data.external.modal_source_hash: Reading...
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=af130657ae9e45b59a91c40cb362fb3d]
cloudflare_d1_database.main: Refreshing state... [id=f55dda63-da5a-4103-a56d-ed1c088d4bdc]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=5362931991703516751]
null_resource.d1_migrations: Refreshing state... [id=4474558107364533092]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=bf88879cbd93491ebae373f07687249e]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=f4464ca5-f2a3-4514-849f-91cf38426871]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=c8d1ec4d-22cb-40d1-b93f-acf68d7b61e1]
null_resource.web_app_cloudflare_deploy[0]: Refreshing state... [id=2850764720952892422]
module.github_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=70cca814a115489c9546f56362d2d84a]
null_resource.web_app_cloudflare_secrets[0]: Refreshing state... [id=6050167598202515541]
module.github_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=34793591-a293-43bd-8e41-b6d48447efc3]
module.github_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=e2241d1a-883e-4a83-b9d0-4ba61bd76dce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.web_app_wrangler_production[0] will be created
  + resource "local_file" "web_app_wrangler_production" {
      + content              = <<-EOT
            name = "open-inspect-web-colleqtive"
            main = ".open-next/worker.js"
            compatibility_date = "2025-08-15"
            compatibility_flags = ["nodejs_compat", "global_fetch_strictly_public"]
            
            [vars]
            GITHUB_CLIENT_ID = "Iv23livHLxZ9Ei4Ppgtt"
            NEXTAUTH_URL = "https://open-inspect-web-colleqtive.cllqtv.workers.dev"
            CONTROL_PLANE_URL = "https://open-inspect-control-plane-colleqtive.cllqtv.workers.dev"
            NEXT_PUBLIC_WS_URL = "wss://open-inspect-control-plane-colleqtive.cllqtv.workers.dev"
            ALLOWED_USERS = ""
            ALLOWED_EMAIL_DOMAINS = ""
            
            [assets]
            directory = ".open-next/assets"
            binding = "ASSETS"
            
            [[services]]
            binding = "CONTROL_PLANE_WORKER"
            service = "open-inspect-control-plane-colleqtive"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../..//packages/web/wrangler.production.toml"
      + id                   = (known after apply)
    }

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "3175466959401002852" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-26T09:23:03Z" -> (known after apply)
        }
    }

  # null_resource.github_bot_build[0] must be replaced
-/+ resource "null_resource" "github_bot_build" {
      ~ id       = "2891797195268965891" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-26T09:23:03Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_build[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_build" {
      ~ id       = "8053711833804605722" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-26T09:23:03Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_deploy[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_deploy" {
      ~ id       = "2850764720952892422" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-26T09:23:29Z" -> (known after apply)
        }
    }

  # module.control_plane_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value)
      ~ created_on          = "2026-02-26T09:23:10Z" -> (known after apply)
      ~ id                  = "f4464ca5-f2a3-4514-849f-91cf38426871" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/control-plane/dist/index.js" -> null
              - content_sha256 = "7c443d5dd874c46a07008f0b76acdb9888665e3ef03f8a7b6055074681c2d0f9" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/control-plane/dist/index.js"
              + content_sha256 = "59291cee9df18652f274430a39efbc6acffad6621e245f64169da6aaf19ee6a6"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 10 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "dev@colleqtive.com" -> (known after apply)
      ~ created_on   = "2026-02-26T09:23:12Z" -> (known after apply)
      ~ id           = "c8d1ec4d-22cb-40d1-b93f-acf68d7b61e1" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "f4464ca5-f2a3-4514-849f-91cf38426871" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-26T09:23:13Z" -> (known after apply)
      ~ id                  = "34793591-a293-43bd-8e41-b6d48447efc3" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 3 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "dev@colleqtive.com" -> (known after apply)
      ~ created_on   = "2026-02-26T09:23:15Z" -> (known after apply)
      ~ id           = "e2241d1a-883e-4a83-b9d0-4ba61bd76dce" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "34793591-a293-43bd-8e41-b6d48447efc3" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @jmunckhof*